<template>
  <v-card :height="height" class="scroll" outlined color="grey lighten-2">
    <v-card-title class="d-flex justify-center text-no-wrap">
      Hindi-only Policy Component (loaded dynamically)
    </v-card-title>
    <v-card-text>
      <div class="text-overline mx-8">
        ट्रूपनियन गोपनीयता नीति
      </div>
      <div class="content">
1 जनवरी, 2017 से प्रभावी<br/>
<br/>
अपने निजी व्यक्तिगत जानकारी की आवश्यकता के बारे में महत्वपूर्ण सूचना:<br/>
<br/>
हमारे पास यह नोटिस क्यों है?<br/>
ट्रूपानियन में, हम आपकी गोपनीयता का सम्मान करने और आपके विश्वास को बनाए रखने के महत्व को जानते हैं। हमारे लिए यह महत्वपूर्ण है कि आप अपनी व्यक्तिगत जानकारी की सुरक्षा के लिए हमारे पास मौजूद उपायों को समझें। और, निश्चित रूप से, हमें किसी भी कानून का पालन करने की आवश्यकता है जो हमें आपके साथ साझा करने की आवश्यकता है कि हम इस जानकारी को कैसे प्रबंधित करते हैं। हम क्या करते हैं यह समझने के लिए कृपया इस नोटिस को ध्यान से पढ़ें।<br/>
<br/>
कौन सी निजी जानकारी हम एकत्र करते हैं?<br/>
हमारे द्वारा एकत्र की जाने वाली व्यक्तिगत जानकारी के प्रकार में शामिल हो सकते हैं:<br/>
<br/>
आपका नाम, पता, ईमेल पता और फ़ोन नंबर<br/>
हमारे साथ आपके व्यवहार के बारे में जानकारी, जिसमें नीति की जानकारी, दावे का इतिहास, प्रीमियम और भुगतान की जानकारी शामिल है।<br/>
हम इस व्यक्तिगत जानकारी को कैसे एकत्रित करते हैं?<br/>
हम आपकी व्यक्तिगत जानकारी एकत्र करते हैं, उदाहरण के लिए, जब आप:<br/>
<br/>
बीमा के लिए आवेदन करें, प्रीमियम का भुगतान करें या अपनी पॉलिसी में बदलाव करें<br/>
दावा करना<br/>
रोजगार की जानकारी दें<br/>
ग्राहक सर्वेक्षण भरें<br/>
हम दूसरों से व्यक्तिगत जानकारी भी एकत्र करते हैं, जैसे सहयोगी, या संयुक्त विपणन साझेदार या लीड प्रोवाइडर।<br/>
      </div>
    </v-card-text>
  </v-card>
</template>

<script lang="ts">

export default {
  name: 'PolicyEn',
  props: {
    height: {
      type: Number
    }
  }
}

</script>

<style lang="scss">

  .content {
    text-align: left;
  }

  .scroll {
    overflow-y: scroll
  }

</style>
